{
	"_meta": {
		"sources": [
			{
				"json": "TftJC",
				"abbreviation": "TftJC",
				"full": "Tales from the Jaazdin Collective",
				"authors": [],
				"convertedBy": [],
				"version": "0.0.11"
			}
		]
	},
	"spell": [
		{
			"name": "Artist's Touch",
			"source": "TftJC",
			"page": 55,
			"level": 0,
			"school": "C",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 60
				}
			},
			"components": {
				"s": true,
				"m": "a paint bruch, quill or similar artistic tool"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "hour",
						"amount": 1
					}
				}
			],
			"entries": [
				"You conjure from the tip of your brush or quill a single magical effect as a manifestation of your artistic spirit. You can create one of the following effects:",
				{
					"type": "list",
					"items": [
						"You instantly cause a message no more than 25 words in length to appear on a surface within range. The message appears in ink or paint and remains for 1 hour.",
						"You touch unsculpted clay, a bottle of paint, or an ink pot and immediately shape it into an artistic work no larger than 2ft in any dimension. The work is fair but unimpressive to any discerning eye. The work remains for 1 hour.",
						"You draw or sculpt a simple object worth no more than 1gp and it becomes real. The object is brittle and breaks under heavy use, close inspection reveals it to be made of worthless paste. If you have an example of an object on you when you cast the spell you can duplicate it, such as a specific key, otherwise the objects are generic. The object lasts for 1 hour or until it breaks.",
						"You summon forth a splash of ink or paint at one target within 15ft attempting to blind them. The creature must make a Constitution saving throw or be blinded until the end of their next turn."
					]
				},
				"If you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action. If you cast a new one the oldest effect ends."
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Sorcerer",
						"source": "PHB"
					},
					{
						"name": "Warlock",
						"source": "PHB"
					},
					{
						"name": "Bard",
						"source": "PHB"
					},
					{
						"name": "Artificer",
						"source": "TCE"
					}
				]
			}
		},
		{
			"name": "Aqua Whip",
			"source": "TftJC",
			"page": 55,
			"level": 0,
			"school": "T",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "radius",
				"distance": {
					"type": "feet",
					"amount": 15
				}
			},
			"components": {
				"v": true,
				"s": true
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You lash out with a watery strike 5 feet wide and 15 feet long. Creatures within the line must make a Dexterity saving throw, and on a fail take {@dice 1d4} bludgeoning damage and are knocked prone. You can also use this to pull a loose object that isn't worn or carried within the spell's range to you",
				"This spell’s damage increases by {@dice 1d4} when you reach 5th level {@dice 2d4}, 11th level {@dice 3d4}, and 17th level {@dice 4d4}."
			],
			"scalingLevelDice": {
				"scaling": {
					"1": "1d4",
					"5": "2d4",
					"11": "3d4",
					"17": "4d4"
				}
			},
			"damageInflict": [
				"bludgeoning"
			],
			"savingThrow": [
				"dexterity"
			],
			"classes": {
				"fromClassList": [
					{
						"name": "Druid",
						"source": "PHB"
					}
				]
			}
		}
	]
}