{
  "name": "Hewn Arcstone",
  "source": "TftJC",
  "type": "TG",
  "rarity": "rare",
  "customProperties": {
    "planeOfOrigin": "The Weave",
    "requiredTool": "Smith's Tools",
    "forgingConditions": "INT, CHA, or WIS of 16 or Higher",
    "armorEffects": "When you expend a spell slot of 4th level or lower you can add a bonus to the damage roll equal to the spell's level. Hewn Arcstone can be worked into Refined Arcstone with a DC 30 Smith's tools check.",
    "weaponEffects": "When concentrating on a spell this weapon deals half the spell's level in additional force damage as long as the spell is of 4th level or lower. Hewn Arcstone can be worked into Refined Arcstone with a DC 30 Smith's tools check.",
    "additionalEffects": "A plate of Rough Arcstone can be worked into Refined Arcstone with a DC 30 Smith's Tools check. A plate of Hewn Arcstone can be used to fuel an enchantment, consuming the plate and progressing the enchantment by 50.",
    "runesmithing": "???",
    "druidUseable": true
  },
  "entries": [
    {
      "type": "entries",
      "name": "Properties",
      "entries": [
        "<b>Plane of Origin:</b> The Weave",
        "<b>Required Tool:</b> Smith's Tools",
        "<b>Forging Conditions:</b> INT, CHA, or WIS of 16 or Higher",
        "<b>Armor Effects:</b> When you expend a spell slot of 4th level or lower you can add a bonus to the damage roll equal to the spell's level. Hewn Arcstone can be worked into Refined Arcstone with a DC 30 Smith's tools check.",
        "<b>Weapon Effects:</b> When concentrating on a spell this weapon deals half the spell's level in additional force damage as long as the spell is of 4th level or lower. Hewn Arcstone can be worked into Refined Arcstone with a DC 30 Smith's tools check.",
        "<b>Additional Effects:</b> A plate of Rough Arcstone can be worked into Refined Arcstone with a DC 30 Smith's Tools check. A plate of Hewn Arcstone can be used to fuel an enchantment, consuming the plate and progressing the enchantment by 50.",
        "<b>Runesmithing:</b> ???",
        "<b>Druid Useable:</b> Yes"
      ]
    }
  ]
}
