{
  "name": "Mercurial Sludge",
  "source": "TftJC",
  "type": "TG",
  "rarity": "very rare",
  "customProperties": {
    "baseMetal": "Devil's Mercury",
    "requiredTool": "Alchemist's Supplies",
    "forgingConditions": "Must be processed using divine alchemy.",
    "armorEffects": "Heavy Armor is treated as Medium Armor, and Medium armor is treated as Light. Light Armor requires no proficiency to wear. This armor can be absorbed into your body or expunged as a Free Action, allowing you to instantly don or doff it.",
    "weaponEffects": "Weapon attacks that hit a creature force a DC 17 Con save (poison effect), and on a fail the target suffers 1d6 Necrotic damage at the start of their turn. This lasts for 1 minute, and the target can repeat this saving throw to end the effect early. This weapon can be absorbed into your body or expunged as a Free Action, allowing you to instantly wield or hide it.",
    "additionalEffects": "You can cast Polymorph on yourself once per day without using a spell slot.",
    "druidUseable": false
  },
  "entries": [
    "Runesmithed",
    {
      "type": "entries",
      "name": "Properties",
      "entries": [
        "<b>Base Metal:</b> {@item Devil's Mercury|TftJC}",
        "<b>Required Tool:</b> Alchemist's Supplies",
        "<b>Forging Conditions:</b> Must be processed using divine alchemy.",
        "<b>Armor Effects:</b> Heavy Armor is treated as Medium Armor, and Medium armor is treated as Light. Light Armor requires no proficiency to wear. This armor can be absorbed into your body or expunged as a Free Action, allowing you to instantly don or doff it.",
        "<b>Weapon Effects:</b> Weapon attacks that hit a creature force a DC 17 Con save (poison effect), and on a fail the target suffers 1d6 Necrotic damage at the start of their turn. This lasts for 1 minute, and the target can repeat this saving throw to end the effect early. This weapon can be absorbed into your body or expunged as a Free Action, allowing you to instantly wield or hide it.",
        "<b>Additional Effects:</b> You can cast Polymorph on yourself once per day without using a spell slot.",
        "<b>Druid Useable:</b> No"
      ]
    }
  ]
}
