{
  "name": "Villainous Radium",
  "source": "TftJC",
  "type": "TG",
  "rarity": "very rare",
  "customProperties": {
    "planeOfOrigin": "Material",
    "requiredTool": "Alchemist's Supplies",
    "secondaryTool": "Glassblower's Tools",
    "forgingConditions": "?",
    "baseMetals": "Living Lava + Unstable Uranium",
    "armorEffects": "Cannot be crafted into a shield or Light armor. This armor is sentient, with an INT of 2, WIS of 8 and CHA of 12 (LE). While wearing this armor, your maximum Hitpoints are Reduced by 25, and are reduced by another 25 for each consecutive week of use (these hitpoints return after a week without wearing the armor). You gain Immunity to Fire and Necrotic Damage. Taking Fire Damage Increases your AC by an amount equal to 1/10th (min 0) of the damage you would have taken (before immunity/resistances) until the end of your next turn.",
    "weaponEffects": "Cannot be made into Ammunition or Light Weapons. This weapon is sentient, with an INT of 2, WIS of 8 and CHA of 12 (LE). While wielding this weapon, your Maximum hitpoints are reduced by 13, and are reduced by another 13 for each consecutive week of use (these hitpoints return after a week without wielding the weapon). This weapon doubles the effectiveness of any enchantment that increases its to hit and damage roll bonus (up to a +6). You gain a bonus to Intimidation checks equal to the Enchantment Bonus with this weapon while wielding it. As a reaction to making an attack roll with this weapon, you can make an Intimidation Check, and gain a bonus to the d20 roll equal to 1/10th of the value rolled. If this makes the die value over your Critical Hit threshold, it is a Critical Hit.",
    "additionalEffects": "If left unwielded for 1 month, the Armor/Weapon gets up and leaves, looking for a new host. Makes you sick ):",
    "druidUseable": true
  },
  "entries": [
    {
      "type": "entries",
      "name": "Properties",
      "entries": [
        "<b>Plane of Origin:</b> Material",
        "<b>Required Tool:</b> Alchemist's Supplies",
        "<b>Secondary Tool:</b> Glassblower's Tools",
        "<b>Forging Conditions:</b> ?",
        "<b>Base Metals:</b> {@item Living Lava|TftJC} + {@item Unstable Uranium|TftJC}",
        "<b>Armor Effects:</b> Cannot be crafted into a shield or Light armor. This armor is sentient, with an INT of 2, WIS of 8 and CHA of 12 (LE). While wearing this armor, your maximum Hitpoints are Reduced by 25, and are reduced by another 25 for each consecutive week of use (these hitpoints return after a week without wearing the armor). You gain Immunity to Fire and Necrotic Damage. Taking Fire Damage Increases your AC by an amount equal to 1/10th (min 0) of the damage you would have taken (before immunity/resistances) until the end of your next turn.",
        "<b>Weapon Effects:</b> Cannot be made into Ammunition or Light Weapons. This weapon is sentient, with an INT of 2, WIS of 8 and CHA of 12 (LE). While wielding this weapon, your Maximum hitpoints are reduced by 13, and are reduced by another 13 for each consecutive week of use (these hitpoints return after a week without wielding the weapon). This weapon doubles the effectiveness of any enchantment that increases its to hit and damage roll bonus (up to a +6). You gain a bonus to {@skill Intimidation} checks equal to the Enchantment Bonus with this weapon while wielding it. As a reaction to making an attack roll with this weapon, you can make an {@skill Intimidation} Check, and gain a bonus to the d20 roll equal to 1/10th of the value rolled. If this makes the die value over your Critical Hit threshold, it is a Critical Hit.",
        "<b>Additional Effects:</b> If left unwielded for 1 month, the Armor/Weapon gets up and leaves, looking for a new host. Makes you sick ):",
        "<b>Druid Useable:</b> Yes"
      ]
    }
  ]
}
