{
  "name": "Shard of Illumina",
  "source": "TftJC",
  "type": "WD",
  "rarity": "rare",
  "wondrous": true,
  "reqAttune": true,
  "curse": true,
  "entries": [
    "This 1-foot-long shard of gold has veins of silver and platinum along its surface.",
    "Empowered Magic. While holding this shard, you can use it as a spellcasting focus, and it gives a +1 bonus to your spell attack rolls. ",
    "Enhanced Intelligence. Your Intelligence score increases by 2 while the shard is on your person. The shard can't raise your Intelligence score above 22. ",
    "<i><b>Curse.</i></b> Attuning to this item extends it curse to you. You remain cursed until you are targeted by a {@spell remove curse} spell or similar magic.",
    "The shard's curse causes misfortune to befall you. When you roll 1 on an attack roll, an ability check, or a saving throw, roll on the Shard Misfortunes table to determine your misfortune.",
    {
      "type": "table",
      "caption": "Shard Misfortunes table",
      "colLabels": ["{@dice d6}", "Effect"],
      "colStyles": ["col-1 text-center", "col-11"],
      "rows": [
        [
          "1",
          "You accidentally cut yourself with the shard and are {@condition poisoned} until the next dawn."
        ],
        [
          "2",
          "You experience a vision of an ancient calamity—a beautiful city threatened by crumbling mountains and erupting volcanoes—and are {@condition stunned} until the end of your next turn."
        ],
        [
          "3",
          "For a few seconds, the ground shakes under you. You and each creature within 10 feet of you must succeed on a DC 18 Dexterity saving throw or be knocked {@condition prone}."
        ],
        [
          "4",
          "The shard releases four glowing darts of magical force that target one random creature within 30 feet of you. If no such target exists, you become the target. Each dart hits automatically and deals 3 ({@dice 1d4 + 1}) force damage to the target."
        ],
        ["5", "Until the next dawn, you have -1 to all saving throws."],
        [
          "6",
          "Nothing seems to go your way. Until the next dawn, you have disadvantage on ability checks."
        ]
      ],
      "data": {
        "tableInclude": true
      }
    }
  ]
}
