{
    "name": "Figurine of Wondrous Knowledge (Onyxphire Crow)",
    "source": "TftJC",
    "rarity": "very rare",
    "baseItem": "Figurine of Wondrous Power|DMG",
    "wondrous": true,
    "entries": [
        "A figurine of wondrous power is a statuette of a beast small enough to fit in a pocket. If you use an action to speak the command word and throw the figurine to a point on the ground within 60 feet of you, the figurine becomes a living creature. If the space where the creature would appear is occupied by other creatures or objects, or if there isn't enough space for the creature, the figurine doesn't become a creature.",
        "The creature exists for a duration specific to each figurine. At the end of the duration, the creature reverts to its figurine form. It reverts to a figurine early if it drops to 0 hit points or if you use an action to speak the command word again while touching it. When the creature becomes a figurine again, its property can't be used again until a certain amount of time has passed, as specified in the figurine's description.",
        {
            "type": "entries",
            "name": "{@creature crow|WDMM|Silver Raven}",
            "entries": [
                "This onyx statuette of a crow is embedded with sapphire tears. While within darkness it can be activated, becoming the Wereraven Lavore. This transformation lasts for up to 6 hours, once used it cannot be used again for 7 days.",
                "Lavore is a lawful Neutral military historian who studied under the Sapphire dragon Traz'zyn, the Supreme Tactician. He has an intelligence of 18, wisdom of 10, and charisma of 9; Speak read and write in Common, Draconic, Deep speech, and Gnomish; He has extensive and narrow knowledge on the history of Illusion magic, extraplanar travel, Lolth's arachnid decedents, and aberrations with innate psionic abilities. He has a +9 bonus to intelligence checks to recall lore from any of these areas of expertise (including his intelligence mod)."
            ]
        }
    ]
}