{
  "name": "Future of Chromaticism Dragon Masks",
  "source": "TftJC",
  "rarity": "legendary",
  "reqAttune": true,
  "entries": [
    "These masks bear the visage of oneself realized as a Chromatic Dragon. regardless if attuned or not, the magic of the mask remains bonded to the being that is bound by infernal contract to Tiamat. Some features persist even without being attuned, and can not be undone except by being removed from the Infernal Contract.",
    "The Dragon masks are no longer cursed, and lose their Cursed effects. Instead, the wearers gains the following Madness effects:",
    "{@item Blue Dragon Mask|RoTOS} - Combat is an art, and should be seen as such. There is elegance in outwitting foes, and your battles should herald acclaim.",
    "{@item Black Dragon Mask|RoTOS} - Combat and victory is more than about winning, its about instilling fear in those who are beneath you.",
    "{@item Red Dragon Mask|RoTOS} - Combat is a necessary tool that none wield better. The world is rightfully mine.",
    "{@item Green Dragon Mask|RoTOS} - Combat is a new opportunity to proves one's intellect. Fighting fair would be holding back.",
    "If you are to die, and not revived within 1 day, you are reborn as an Adult Dragon of your associated colour. You can choose to transform early into your Dragon, but cannot undo this form afterwards. Alternatively, after 100 years pass (dead or alive), you transform into an adult dragon.",
    "As an Action, the wielder can change this into any melee weapon they are proficient with.",
    "While attuned you gain all other benefits of the masks and,",
    "You gain an associated Breath Weapon of a Young Dragon of your colour, recharging on a 6. Your creature type is considered Humanoid/Dragon. As a part of a 1 minute ritual, you and all of your equipment (except for the associated Blade) can transform into a Young Dragon of your colour. You retain your mental statistics, but not class/racial features. Dropping to 0 hit points or after 1 hour passes transforms you back. Each time you do so 1d4 years is removed from your timer."
  ]
}
