{
    "name": "Sanguinity",
    "source": "TftJC",
    "rarity": "very rare",
    "wondrous": true,
    "curse": true,
    "reqAttune": true,
    "entries": [
        "This tarnished, silvered bracer slides with ease onto any wrist. The bracer is made of Devil’s Mercury inlaid with Bloodsteel. No matter what form of bracer, it always retains an intricate design depicting a well crafted yet horrifying visage of the arts of Sanguine Alchemy.",
        "This bracer punctures into the vital vein of the wearer, using their life essence to power its alchemy. Upon attuning to this item, a creature takes 5 points of piercing damage. ",
        "Once attuned, the wearer gains these following traits:",
        {
            "type": "list",
            "style": "list-hang",
            "items": [
                "Clotted Regeneration: At the start of your turn, you can expend a use of your Hit Dice to gain Temporary HP equal to the amount rolled",
                "Crimson Strike: As a bonus action, you can expend a number of hit dice equal to your level to add to the damage of your next attack (weapon or spell). When you expend these hit dice, roll half the amount of those dice (rounded up) and you take piercing damage equal to the number rolled. This damage cannot be reduced in any way.",
                "Blood Shield: When you are hit with an attack, you can use your reaction to expend a Hit Dice and increase your AC by the amount rolled against that instance of attack.",
                "Eldritch Claret: As an Action, you can expend an amount of Hit Dice equal to the highest Spell Slot you are able to cast, you then regain a spell slot equal to the amount of hit dice you expend. When you expend these Hit Dice, roll half of the amount expended (rounded up), and take piercing damage equal to the amount rolled. This damage cannot be reduced in any way."
            ]
        },
        "Curse: Sanguinity is a cursed item. When a creature attunes to this bracer, they are unable to remove it unless a DC 20 Medicine Check is met as well as a cast of the {@spell Remove Curse} spell.",
        "While the creature is attuned to the bracer, once every two weeks they must roll a DC 14 Wisdom Saving throw or become Blood Starved. While Blood Starved, the creature gains 1 point of exhaustion for every week they do not consume the blood from one humanoid creature (other than yourself). The amount of blood to consume must equal one or more pints.",
        "By drinking blood, you are no longer Blood Starved. If you fail this save again without drinking blood, this effect stacks"
    ]
}