{
  "name": "Shackles of Cavalkal",
  "source": "TftJC",
  "rarity": "legendary",
  "wondrous": true,
  "curse": true,
  "entries": [
    "You gain proficiency in Athletics, if you already have proficiency you gain expertise, if you already have expertise you gain a +3 to the check. When you make an Athletics check or force a creature to make a Strength saving throw to grapple or move a creature, you have advantage on the roll.",
    "If you do not spend any movement on your turn your AC increases by 1 and you gain advantage on any checks or saving throws against effects that would move you.",
    "When you force a creature to move through an attack or spell they move an additional 15ft and take {@dice 3d6} Bludgeoning damage. In addition, if the creature has a fly speed that speed is reduced to 0 until the start of their next turn.",
    {
      "type": "entries",
      "name": "Cursed",
      "entries": [
        "The heavy gauntlets weigh you down, your speed is decreased by 15ft in all forms. In addition, if you fall, you fall 2400 feet on your turn instead of 60 feet and take double falling damage."
      ]
    },
    {
      "type": "entries",
      "name": "Form of the Mountain",
      "entries": [
        "As an action, you can set loose the spirit contained within the shackles to fight alongside you. The spirit takes on the form of an Elemental from the following list: Earth Elemental Myrmidon, Xorn, Dust Hulk, or Earth Elemental.",
        "While the spirit is active and has more than 0 hit points, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You gain resistance to bludgeoning, slashing, and piercing damage.",
            "If you deal bludgeoning damage to a creature you can also move them 5ft, this can effect a creature only once a turn.",
            "When a creature attempts to move you through any effect, it fails and the other creature suffers the movement instead, if applicable."
          ]
        },
        "When the spirit drops to 0 hit points or 1 hour passes, it vanishes, and you lose the benefits listed above. Once you use this ability, you cannot use it again for 90 days. As an action, you can cast a 5th level or higher spell that deals piercing, bludgeoning, or slashing damage into the Shackles to lower the time to wait by 1 day."
      ]
    }
  ]
}
