{
  "name": "The Dashers of Elitanith",
  "source": "TftJC",
  "rarity": "legendary",
  "wondrous": true,
  "curse": true,
  "entries": [
    "Your movement speed increases by 20 feet and you gain a fly speed equal to your speed. In addition, your speed cannot be reduced lower than 20 feet (unless it is reduced to 0).",
    {
      "type": "entries",
      "name": "Stride of the Free",
      "entries": [
        "You can use a bonus action on your turn to disengage. Once per turn, when you are suffering from the Grapple, Restrained, or Prone condition you can spend 5 feet of movement to end the condition. When you do this each creature of your choice within 10 feet of you must make a DC 15 Str save or be knocked back 15 feet."
      ]
    },
    {
      "type": "entries",
      "name": "Cursed",
      "entries": [
        "If you do not move your full movement on your turn you suffer {@dice 8d4} slashing damage as the agitated wind attacks you."
      ]
    },
    {
      "type": "entries",
      "name": "Form of the Gales",
      "entries": [
        "As an action, you can set loose the spirit contained within the boots to fight alongside you. The spirit takes on the form of an Elemental from the following list: Air Elemental Myrmidon, Invisible Stalker, Animated Breath, or Air Elemental.",
        "While the spirit is active and has more than 0 hit points, you gain the following benefits:",
        {
          "type": "list",
          "items": [
            "You gain immunity to lightning and thunder damage",
            "Your speed increases to 120 ft if its lower and cannot be lowered (unless it is reduced to 0), your fly speed likewise increases to the same amount. You do not provoke attacks of opportunity for moving.",
            "When you cast a spell that deals lightning or thunder damage, you may reroll any 1s or 2s rolled on the damage and take the higher result."
          ]
        },
        "When the spirit drops to 0 hit points or 1 hour passes, it vanishes, and you lose the benefits listed above. Once you use this ability, you cannot use it again for 90 days. As an action, you can cast a 5th level or higher spell that deals lightning and thunder damage into the Dashers to lower the time to wait by 1 day."
      ]
    }
  ]
}
